"""
Вывести сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
"""
i_sum =0
for i in range(1, 101):
    #print(i)
    i_sum +=i

print('i_sum=',i_sum)